Охотники_и_рыболовы/src/Documents/ПутевкаДоговор/ПутевкаДоговор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПутевкаДоговор</name>
  <basedOn>Document.РазрешениеНаОхоту</basedOn>
  <registerRecords>AccumulationRegister.ПродажаПутевок</registerRecords>
  <attributes>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоОхоты</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотник</name>
    <type>
      <types>CatalogRef.Охотники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РазрешениеНаОхоту</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сезонная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерияПутевки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПутевки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйПериод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

Охотники_и_рыболовы/src/AccumulationRegisters/ПродажаПутевок/ПродажаПутевок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПродажаПутевок</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОхоты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоОхоты</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтчетныйВидДичи</name>
    <type>
      <types>CatalogRef.ОтчетныеВидыДичи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Охотники_и_рыболовы/src/Documents/ПутевкаДоговор/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат;
	КонецЕсли;
	
	Путевка = ОхотаСервер.НайтиПодчиненнуюПутевку(ДокументОснование.Ссылка);
	
	Если ЗначениеЗаполнено(Путевка)
		И Путевка.Ссылка <> Ссылка Тогда
		
		ТекстСообщения = НСтр(
			"ru = 'Для документа ""%Ссылка%"" 
			|уже введена путевка ""%Путевка%"".
			|Запись еще одного документа ""Путевка"" не допускается!'"
		);
		
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", ДокументОснование.Ссылка);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Путевка%", Путевка);
		
		ВызватьИсключение ТекстСообщения;
		
	КонецЕсли;

	
	
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РазрешениеНаОхоту") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения,,"Проведен,Ссылка,Номер,Ответственный");
		ДокументОснование = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ПродажаПутевок.Очистить();
	Движения.ПродажаПутевок.Записывать = Истина;
	
	Движение = Движения.ПродажаПутевок.Добавить();
	Движение.Период = Дата;
	Движение.СезонОхоты = СезонОхоты;
	Движение.Охотхозяйство = Охотхозяйство;
	Движение.МестоОхоты = МестоОхоты;
	Движение.ВидДичи = ВидДичи;
	Движение.ОтчетныйВидДичи = ВидДичи.ОтчетныйВидДичи;
	Движение.Сумма = Стоимость;
	Движение.Исполнитель = Ответственный;
	Движение.Серия = СерияПутевки;
	Движение.Номер = НомерПутевки;
	Движение.ПериодОхоты = "с " + Формат(ДатаНачала,"ДФ = 'дд.ММ.гггг'") + " по " + Формат(ДатаОкончания,"ДФ = 'дд.ММ.гггг'");
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ПРЕДСТАВЛЕНИЕ(РазрешениеНаОхоту.Ссылка) КАК Разрешение
	//	|ИЗ
	//	|	Документ.РазрешениеНаОхоту КАК РазрешениеНаОхоту
	//	|ГДЕ
	//	|	РазрешениеНаОхоту.ПутевкаДоговор = &ПутевкаДоговор
	//	|	И РазрешениеНаОхоту.Проведен";
	//
	//Запрос.УстановитьПараметр("ПутевкаДоговор", Ссылка);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Выборка = РезультатЗапроса.Выбрать();
	//
	//Если Выборка.Количество() > 1 Тогда
	//	Отказ = Истина;
	//	
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;
	//
	////}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры
